app/controllers/api/forums_controller.rb

    def index
        @forums = Forum.all
---
SELECT "forums".* FROM "forums"

    def show
        @forum = Forum.find_by(id: params[:id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]