app/controllers/api/posts_controller.rb

INSERT INTO "comments" ("author_id", "post_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["body", "sami"], ["created_at", "2020-01-07 23:53:49.847311"], ["updated_at", "2020-01-07 23:53:49.847311"]]
INSERT INTO "posts" ("author_id", "forum_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["forum_id", 1], ["title", "sami"], ["created_at", "2020-01-07 23:53:48.106344"], ["updated_at", "2020-01-07 23:53:48.106344"]]
SELECT "comments"."id" FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    def create
        @post = Post.new(post_params)
        @comment = Comment.new(comment_params)
        if @post.valid? && @comment.is_valid?
            @post.save
            @comment.post_id = @post.id
            @comment.save
            @comments = @post.comments.page(1)