app/views/api/forums/index.json.jbuilder

SELECT "posts"."id" FROM "posts" WHERE "posts"."forum_id" = $1  [["forum_id", 1]]
---
        json.extract! forum, :id, :category, :description
        json.post_count forum.posts.length