app/views/api/forums/show.json.jbuilder

SELECT "posts"."id" FROM "posts" WHERE "posts"."forum_id" = $1  [["forum_id", 1]]
---
    json.extract! @forum, :id, :category, :description
    json.post_count @forum.posts.length

SELECT "comments"."id" FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        json.extract! post, :id, :title, :views
        json.comment_count post.comments.length