app/views/api/posts/show.json.jbuilder

SELECT "comments"."id" FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    json.extract! @post, :id, :title, :views
    json.comment_count @comments.length